experiments/results/logs/burst-hybrid-003/wrk2.txt
Running 2m test @ http://localhost:30080/
  4 threads and 100 connections
  Thread calibration: mean lat.: 6049.751ms, rate sampling interval: 15458ms
  Thread calibration: mean lat.: 6044.323ms, rate sampling interval: 15343ms
  Thread calibration: mean lat.: 6019.051ms, rate sampling interval: 15540ms
  Thread calibration: mean lat.: 6052.597ms, rate sampling interval: 15556ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.89m    27.73s    1.68m    57.94%
    Req/Sec     3.61      0.49     4.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.89m 
 75.000%    1.29m 
 90.000%    1.55m 
 99.000%    1.67m 
 99.900%    1.68m 
 99.990%    1.68m 
 99.999%    1.68m 
100.000%    1.68m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    9871.359     0.000000            1         1.00
   14630.911     0.100000          182         1.11
   23199.743     0.200000          364         1.25
   33226.751     0.300000          546         1.43
   43876.351     0.400000          728         1.67
   53411.839     0.500000          912         2.00
   58654.719     0.550000         1002         2.22
   64094.207     0.600000         1098         2.50
   69337.087     0.650000         1185         2.86
   73203.711     0.700000         1279         3.33
   77135.871     0.750000         1365         4.00
   79101.951     0.775000         1416         4.44
   81723.391     0.800000         1458         5.00
   83820.543     0.825000         1505         5.71
   86507.519     0.850000         1549         6.67
   89980.927     0.875000         1595         8.00
   90898.431     0.887500         1615         8.89
   92733.439     0.900000         1640        10.00
   95092.735     0.912500         1660        11.43
   95879.167     0.925000         1686        13.33
   96862.207     0.937500         1710        16.00
   96993.279     0.943750         1717        17.78
   97648.639     0.950000         1731        20.00
   98107.391     0.956250         1744        22.86
   98238.463     0.962500         1754        26.67
   99090.431     0.968750         1763        32.00
   99221.503     0.971875         1768        35.56
   99287.039     0.975000         1774        40.00
   99614.719     0.978125         1781        45.71
   99745.791     0.981250         1787        53.33
   99811.327     0.984375         1792        64.00
   99876.863     0.985938         1797        71.11
   99876.863     0.987500         1797        80.00
  100007.935     0.989062         1800        91.43
  100335.615     0.990625         1808       106.67
  100335.615     0.992188         1808       128.00
  100335.615     0.992969         1808       142.22
  100335.615     0.993750         1808       160.00
  100401.151     0.994531         1811       182.86
  100401.151     0.995313         1811       213.33
  100466.687     0.996094         1816       256.00
  100466.687     0.996484         1816       284.44
  100466.687     0.996875         1816       320.00
  100466.687     0.997266         1816       365.71
  100466.687     0.997656         1816       426.67
  100466.687     0.998047         1816       512.00
  100466.687     0.998242         1816       568.89
  100532.223     0.998437         1818       640.00
  100532.223     0.998633         1818       731.43
  100532.223     0.998828         1818       853.33
  100532.223     0.999023         1818      1024.00
  100532.223     0.999121         1818      1137.78
  100532.223     0.999219         1818      1280.00
  100532.223     0.999316         1818      1462.86
  100532.223     0.999414         1818      1706.67
  100597.759     0.999512         1819      2048.00
  100597.759     1.000000         1819          inf
#[Mean    =    53551.550, StdDeviation   =    27725.757]
#[Max     =   100532.224, Total count    =         1819]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2023 requests in 2.00m, 20.76MB read
  Socket errors: connect 0, read 0, write 0, timeout 3949
Requests/sec:     16.84
Transfer/sec:    176.97KB